Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70Q19B.atdf
        <register caption="Receive Data Register" name="HSMCI_RDR" offset="0x30" rw="R" size="4">
          <bitfield caption="Data to Read" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Transmit Data Register" name="HSMCI_TDR" offset="0x34" rw="W" size="4">
          <bitfield caption="Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Status Register" name="HSMCI_SR" offset="0x40" rw="R" size="4">
          <bitfield caption="Command Ready (cleared by writing in HSMCI_CMDR)" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready (cleared by reading HSMCI_RDR)" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready (cleared by writing in HSMCI_TDR)" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended (cleared on read)" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress (cleared at the end of CRC16 calculation)" mask="0x00000010" name="DTIP"/>
          <bitfield caption="HSMCI Not Busy" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="SDIO Interrupt for Slot A (cleared on read)" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="CE-ATA Completion Signal Received (cleared on read)" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="Response Index Error (cleared by writing in HSMCI_CMDR)" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error (cleared by writing in HSMCI_CMDR)" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error (cleared by writing in HSMCI_CMDR)" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error (cleared by writing in HSMCI_CMDR)" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error (cleared by writing in HSMCI_CMDR)" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error (cleared on read)" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error (cleared on read)" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Time-out Error (cleared on read)" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="DMA Block Overrun Error (cleared on read)" mask="0x01000000" name="BLKOVRE"/>
          <bitfield caption="FIFO empty flag" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done flag" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Operation Acknowledge Received (cleared on read)" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Operation Acknowledge Error (cleared on read)" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0)" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0)" mask="0x80000000" name="UNRE"/>
        </register>
        <register caption="Interrupt Enable Register" name="HSMCI_IER" offset="0x44" rw="W" size="4" atomic-op="set:HSMCI_IMR">
          <bitfield caption="Command Ready Interrupt Enable" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended Interrupt Enable" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress Interrupt Enable" mask="0x00000010" name="DTIP"/>
          <bitfield caption="Data Not Busy Interrupt Enable" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="SDIO Interrupt for Slot A Interrupt Enable" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status Interrupt Enable" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="Completion Signal Received Interrupt Enable" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="Response Index Error Interrupt Enable" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error Interrupt Enable" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error Interrupt Enable" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error Interrupt Enable" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error Interrupt Enable" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error Interrupt Enable" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error Interrupt Enable" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Timeout Error Interrupt Enable" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="DMA Block Overrun Error Interrupt Enable" mask="0x01000000" name="BLKOVRE"/>
          <bitfield caption="FIFO empty Interrupt enable" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done Interrupt enable" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Acknowledge Interrupt Enable" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Acknowledge Error Interrupt Enable" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun Interrupt Enable" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun Interrupt Enable" mask="0x80000000" name="UNRE"/>
        </register>
        <register caption="Interrupt Disable Register" name="HSMCI_IDR" offset="0x48" rw="W" size="4" atomic-op="clear:HSMCI_IMR">
          <bitfield caption="Command Ready Interrupt Disable" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended Interrupt Disable" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress Interrupt Disable" mask="0x00000010" name="DTIP"/>
          <bitfield caption="Data Not Busy Interrupt Disable" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="SDIO Interrupt for Slot A Interrupt Disable" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status Interrupt Disable" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="Completion Signal received interrupt Disable" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="Response Index Error Interrupt Disable" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error Interrupt Disable" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error Interrupt Disable" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error Interrupt Disable" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error Interrupt Disable" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error Interrupt Disable" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error Interrupt Disable" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Time out Error Interrupt Disable" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="DMA Block Overrun Error Interrupt Disable" mask="0x01000000" name="BLKOVRE"/>
          <bitfield caption="FIFO empty Interrupt Disable" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done Interrupt Disable" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Acknowledge Interrupt Disable" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Acknowledge Error Interrupt Disable" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun Interrupt Disable" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun Interrupt Disable" mask="0x80000000" name="UNRE"/>
        </register>
